app/controllers/courses_controller.rb

  def open
    @course=Course.find_by_id(params[:id])
    @course.open_close = true
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open_close" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open_close", "t"], ["updated_at", "2016-12-31 02:39:00.008362"], ["id", 1]]

  def close
    @course=Course.find_by_id(params[:id])
    @course.open_close = false
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open_close" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open_close", "f"], ["updated_at", "2016-12-31 02:39:06.422606"], ["id", 1]]

  def edit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @course = Course.find_by_id(params[:id])

    if @course.update_attributes(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "course_introduction" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["course_introduction", "aaa"], ["updated_at", "2016-12-31 11:43:23.016894"], ["id", 1]]

  def public_list
     @course=Course.all
---
SELECT "courses".* FROM "courses"

  def list

    @q1=params[:name]
    if @q1.nil? == false
      @course = Course.where("name like '#{@q1}' ")
    else
      @course=Course.all
    end

    @course=@course - current_user.courses
    @course_true=Array.new
    @course.each do |every_course|
---
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def select
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 14]]

  def detail
    @course=Course.find_by_id(params[:id])    #显示课程介绍的方法
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]