app/controllers/grades_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1  [["course_id", 1]]
---
  def index
    if teacher_logged_in?
      @course=Course.find_by_id(params[:course_id])
      @grades=@course.grades
      count_student_major(@grades)
      count_student_department(@grades)
      count_student_grade(@grades)
    elsif student_logged_in?
      @grades=current_user.grades
      @grade_true=Array.new
      @grades.each do |every_grades|