app/controllers/homes_controller.rb

  def index
  	@courses = Course.order("student_num DESC")
  	len = 5
  	if(@courses.length < len)
	  	len = @course.length
	end
  	@top_courses = Array.new
	  (1..len).each do |i|
	  	@top_courses.push(@courses[i-1].course_code+" "+@courses[i-1].name+" "+@courses[i-1].teacher.name)
---
INSERT INTO "courses" ("course_code", "name", "course_type", "credit", "limit_num", "course_week", "course_time", "class_room", "teaching_type", "exam_type", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"